In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
ser1 = Series(np.arange(3),index=['A','B','C'])
ser1 = 2*ser1
ser1

A    0
B    2
C    4
dtype: int64

In [3]:
ser1['B']

2

In [4]:
ser1[1]

2

In [5]:
ser1[0:3]

A    0
B    2
C    4
dtype: int64

In [6]:
ser1[range(3)]

A    0
B    2
C    4
dtype: int64

In [7]:
ser1[['A','B']]

A    0
B    2
dtype: int64

In [8]:
ser1[ser1>3]

C    4
dtype: int64

In [9]:
ser1[ser1>3] = 10
ser1

A     0
B     2
C    10
dtype: int64

In [3]:
dframe = DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','CHI'],columns=['A', 'B','c','d','e'])

In [11]:
dframe

      A   B   c   d   e
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [12]:
dframe['B']

NYC     1
LA      6
SF     11
DC     16
CHI    21
Name: B, dtype: int64

In [14]:
dframe[['B', 'e']]

      B   e
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
CHI  21  24

In [17]:
dframe[dframe['c']> 8]

      A   B   c   d   e
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [8]:
dframe > 10

         A      B      c      d      e
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
CHI   True   True   True   True   True

In [21]:
ser1 > 2

A    False
B    False
C     True
dtype: bool

In [22]:
dframe.ix['LA']

A    5
B    6
c    7
d    8
e    9
Name: LA, dtype: int64

In [23]:
dframe

      A   B   c   d   e
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [24]:
dframe.ix[1]

A    5
B    6
c    7
d    8
e    9
Name: LA, dtype: int64

In [25]:
#data alignment

In [26]:
ser1 = Series([0,1,2], index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [27]:
ser2 = Series([3,4,5,6],index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [28]:
ser1 + ser2

A     3
B     5
C     7
D   NaN
dtype: float64

In [29]:
dframe1 = DataFrame(np.arange(4).reshape((2,2)),columns=list('AB'),index=['NYC','LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [30]:
dframe2 = DataFrame(np.arange(9).reshape((3,3)),columns=list('ADC'),index=['NYC','SF','LA'])
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [31]:
dframe1 + dframe2

      A   B   C   D
LA    8 NaN NaN NaN
NYC   0 NaN NaN NaN
SF  NaN NaN NaN NaN

In [32]:
dframe1.add(dframe2,fill_value=0)

     A   B  C  D
LA   8   3  8  7
NYC  0   1  2  1
SF   3 NaN  5  4

In [33]:
ser3 = dframe2.ix[0]
ser3

A    0
D    1
C    2
Name: NYC, dtype: int64

In [34]:
dframe2 -ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6